app/views/taskboxes/_form.html.erb

SELECT "taskboxes".* FROM "taskboxes" WHERE (id != @taskbox.id ) ORDER BY "taskboxes"."name" ASC
---
		<%= f.label :parent_id %>
		<%= f.collection_select :parent_id, Taskbox.where("id != #{@taskbox.id} ").order(:name), :id, :name, { include_blank: true }, class: 'form-control' %>