app/views/taskboxes/new.html.erb


	<%= f.hidden_field :user_id, value: User.find_by(id: current_user).id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]