app/views/shared/_submenu_taskboxes.html.erb

SELECT  "taskboxes".* FROM "taskboxes" WHERE "taskboxes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
		<li>
			<%= link_to taskbox.name, taskbox, class: "nav-link #{'active' if current_page?(taskbox_path(taskbox)) || @task.present? && @task.taskbox == taskbox}" %>