app/controllers/tasks_controller.rb

	def create
		@task = Task.new(task_params)
		if @task.save
---
INSERT INTO "tasks" ("name", "summary", "description", "created_at", "updated_at", "taskbox_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Task3"], ["summary", "afga"], ["description", "asfa"], ["created_at", "2017-06-06 23:22:23.783474"], ["updated_at", "2017-06-06 23:22:23.783474"], ["taskbox_id", 4]]

	def update
		if @task.update_attributes(task_params)
---
UPDATE "tasks" SET "summary" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["summary", "Make documentation"], ["description", "Make documentation for project"], ["updated_at", "2017-06-06 13:45:08.094758"], ["id", 2]]