app/controllers/taskboxes_controller.rb

	def index
		@taskboxes = Taskbox.all
---
SELECT "taskboxes".* FROM "taskboxes"

	def show
		@tasks = Task.where(taskbox_id: [@taskbox.subtree_ids])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."taskbox_id" IN (4, 5)

	def new
		@taskbox = Taskbox.new
		@taskboxes = Taskbox.all.order(:name)
		@current_uid = User.where(id: current_user)
---
SELECT "taskboxes".* FROM "taskboxes" WHERE (id != @taskbox.id ) ORDER BY "taskboxes"."name" ASC
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@taskbox = Taskbox.new(taskbox_params)
		if @taskbox.save
			redirect_to @taskbox, success: 'Taskbox successfully created'
		else
			@taskboxes = Taskbox.all.order(:name)
---
INSERT INTO "taskboxes" ("name", "created_at", "updated_at", "ancestry", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Taskbox 3"], ["created_at", "2017-06-10 04:15:40.574601"], ["updated_at", "2017-06-10 04:15:40.574601"], ["ancestry", "4"], ["user_id", 1]]
SELECT "taskboxes".* FROM "taskboxes" ORDER BY "taskboxes"."name" ASC

	def edit
		@taskboxes = Taskbox.where("id != #{@taskbox.id}").order(:name)
---
SELECT "taskboxes".* FROM "taskboxes" WHERE (id != 4 ) ORDER BY "taskboxes"."name" ASC

	def update
		if @taskbox.update_attributes(taskbox_params)
---
UPDATE "taskboxes" SET "name" = $1, "updated_at" = $2 WHERE "taskboxes"."id" = $3  [["name", "Taskbox 1(u1)"], ["updated_at", "2017-06-10 04:31:06.609296"], ["id", 13]]

	def destroy
		@taskbox.destroy
---
DELETE FROM "taskboxes" WHERE "taskboxes"."id" = $1  [["id", 1]]

	def set_taskbox
		@taskbox = Taskbox.find(params[:id])
---
SELECT  "taskboxes".* FROM "taskboxes" WHERE "taskboxes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

	def set_current_uid
		@current_uid = User.find(id: current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]